In [2]:
import numpy as np
import pandas as pd

In [10]:
df = pd.read_csv("penguins.csv")
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [11]:
df.isnull().sum()

species               0
island                0
culmen_length_mm      2
culmen_depth_mm       2
flipper_length_mm     2
body_mass_g           2
sex                  10
dtype: int64

In [12]:
df.dropna(inplace=True)
df = df.reset_index(level=None, drop=True)
df.isnull().sum()

species              0
island               0
culmen_length_mm     0
culmen_depth_mm      0
flipper_length_mm    0
body_mass_g          0
sex                  0
dtype: int64

In [13]:
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
4,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE

In [14]:
print(df[df['sex']=='.'].index)

Int64Index([327], dtype='int64')

In [15]:
df = df.drop([df.index[327]]).reset_index(drop=True)

In [17]:
df = pd.get_dummies(df, columns= ['island', 'sex'], drop_first=True, prefix=["i",""])
df.head()

,species,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,i_Dream,i_Torgersen,_MALE
0,Adelie,39.1,18.7,181.0,3750.0,0,1,1
1,Adelie,39.5,17.4,186.0,3800.0,0,1,0
2,Adelie,40.3,18.0,195.0,3250.0,0,1,0
3,Adelie,36.7,19.3,193.0,3450.0,0,1,0
4,Adelie,39.3,20.6,190.0,3650.0,0,1,1

In [18]:
df = df.rename(columns = {"_MALE":"gender"})

In [19]:
from sklearn.preprocessing import normalize

normcols = ['culmen_length_mm', 'culmen_depth_mm', 'flipper_length_mm', 'body_mass_g']

df[normcols] = pd.DataFrame(normalize(df[normcols]))

In [20]:
df.head()

,species,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,i_Dream,i_Torgersen,gender
0,Adelie,0.010414,0.004981,0.048207,0.998771,0,1,1
1,Adelie,0.010382,0.004573,0.048886,0.998740,0,1,0
2,Adelie,0.012377,0.005528,0.059887,0.998113,0,1,0
3,Adelie,0.010620,0.005585,0.055851,0.998367,0,1,0
4,Adelie,0.010752,0.005636,0.051981,0.998574,0,1,1

In [21]:
df.to_csv("penguins_preprocessed.csv", index=False)